# ----- 信息 -----
# @filename trCmd.sh
# @version 1.0
# @author qye.zheng
# @description tr

#!/bin/bash

################################################################################################


# 大写替换为小写
echo "HELLO WHO IS THIS" | tr "A-Z" "a-z" | cat -n

# 加密
echo "12345" | tr "0-9" "9876543210"
# 解密
echo "87654" | tr "9876543210" "0-9"

# 删除stdin中的数字
echo "hello 123 world 456" | tr -d "0-9"

#
# 将不在补集中的字符删除

echo "hello 1 char 2 next 4" | tr -d -c "0-9 \n"

echo "GNU is not  UNIX.Recursive right ?" | tr -s " "

# 在sum.txt文件中的换行符替换为+号，最后多一个加号补充一个0
# $[  ] 执行运算， tr命令得到 $(1+2+3+4+5+0)
cat sum.txt | echo $[ $(tr "\n" "+") 0 ]


# haha

################################################################################################



#

#

#



################################################################################################


#

#

#


################################################################################################















