# ----- 信息 -----
# @filename echo.sh
# @version 1.0
# @author qye.zheng
# @description echo

#!/bin/bash

################################################################################################


#

echo "abc cc"
# 显示换行 -e 开启转义
echo -e "abc \n cc"
# 显示不换行 -e 开启转义 \c
echo -e "ok \c"
echo "It is test"

# 显示结果覆盖到文件
echo "to file ha" > myfile
# 显示结果追加到文件
echo "append" >> myfile
echo "a"
echo "b"

# 显示命令执行结果，``
echo `date`
echo `pwd`

#

#

################################################################################################



#

#

#



################################################################################################


#

#

#


################################################################################################















