# ----- 信息 -----
# @filename function.sh
# @version 1.0
# @author qye.zheng
# @description 函数

#!/bin/bash

################################################################################################

# 格式1
:<<COMM
function fun_name()
{
  # 返回值 [0, 255]
  # 返回一个整型，不显式返回则以最后一条命令的结果作为返回值
  return int;
}

COMM

# 格式2
:<<COMM
# 不带关键字
fun_name()
{
 # 返回值 [0, 255]
 # 返回一个整型，不显式返回则以最后一条命令的结果作为返回值
 return xx;
}
COMM
# 定义函数
function printStar()
{
  val=5
  if test -z $1
  then
    echo "参数为空，使用默认值 5"
    val=5
  else
  # 参数
  val=$1  
 fi
 while (( $val > 0 ))
 do
  # 不换行
  echo -e "# \c"
  let "val--"
 done
  echo ""
 #echo -e "\n"
}

# 调用函数
printStar 3
printStar

# 注意调用函数不要带括号
# 传参: fun_name param1 param2 ...
#

#

################################################################################################



#

#

#



################################################################################################


#

#

#


################################################################################################















