# ----- 信息 -----
# @filename ioRedirect.sh
# @version 1.0
# @author qye.zheng
# @description 输入输出重定向

#!/bin/bash

################################################################################################


#

#

#

################################################################################################



# 输出重定向
# 输出到文件
ls -lt > myfile

# 追加到文件
ls -lth >> myfile



#

# 输入重定向
tail < myfile

#
wc -l < myfile

# 将开始标记tag和结束标记tag之前的内容作为输入
cat << MY
 jla
 kkdf
dfkd 

MY



################################################################################################

# /dev/null文件 执行一个命令，不希望输出显示到屏幕上，可重定向到/dev/null
# /dev/null是一个特殊文件，写入到它的内容会被丢弃；若尝试从该文件读取内容，
# 那什么也读取不到，达到禁止输出的效果1
command >> /dev/null
# 若希望屏蔽stdout stderror，可以这样写
# 0-标准输入(STDIN) 1-标准输出(STDOUT) 2-标准错误输出(STDERR)
# 将2输出到标准输出&1
# command > /dev/null 2>&1



#

#

#


################################################################################################















